; ModuleID = '/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/src/convolution.c'
source_filename = "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/src/convolution.c"
target datalayout = "e-m:e-p:32:32-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7--linux-gnueabihf"

%struct.layer = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, float*, float* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [17 x i8] c"Output Channel: \00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c" %d\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"Input Channel: \00", align 1
@.str.3 = private unnamed_addr constant [25 x i8] c"Input width and height: \00", align 1
@.str.4 = private unnamed_addr constant [33 x i8] c"Weight filter width and height: \00", align 1
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.6 = private unnamed_addr constant [27 x i8] c"LOAD config in layer.txt\0A\0A\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"layer.txt\00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/src/convolution.c", directory: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/build/zed_linux_hw")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32, align: 32)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32, align: 32)
!6 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 216, baseType: !9)
!8 = !DIFile(filename: "/opt/Xilinx/SDK/2018.2/gnu/aarch32/lin/gcc-arm-linux-gnueabi/lib/gcc/arm-linux-gnueabihf/7.2.1/include/stddef.h", directory: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/build/zed_linux_hw")
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{i32 1, !"wchar_size", i32 4}
!13 = !{i32 1, !"min_enum_size", i32 4}
!14 = !{i32 1, !"PIC Level", i32 2}
!15 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!16 = distinct !DISubprogram(name: "init_convolution_size", scope: !1, file: !1, line: 13, type: !17, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "layer", file: !21, line: 21, baseType: !22)
!21 = !DIFile(filename: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/src/main.h", directory: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/build/zed_linux_hw")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "layer", file: !21, line: 9, size: 352, align: 32, elements: !23)
!23 = !{!24, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !22, file: !21, line: 10, baseType: !25, size: 32, align: 32)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !22, file: !21, line: 11, baseType: !25, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !22, file: !21, line: 12, baseType: !25, size: 32, align: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !22, file: !21, line: 13, baseType: !25, size: 32, align: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "out_w", scope: !22, file: !21, line: 14, baseType: !25, size: 32, align: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "out_h", scope: !22, file: !21, line: 15, baseType: !25, size: 32, align: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !22, file: !21, line: 16, baseType: !25, size: 32, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !22, file: !21, line: 17, baseType: !25, size: 32, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !21, line: 18, baseType: !25, size: 32, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !22, file: !21, line: 19, baseType: !5, size: 32, align: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !22, file: !21, line: 20, baseType: !5, size: 32, align: 32, offset: 320)
!36 = !{!"init_convolution_size"}
!37 = !{!"void.layer *.1"}
!38 = !{!"/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/src/convolution.c"}
!39 = !{!"t"}
!40 = !DILocalVariable(name: "pl", arg: 1, scope: !16, file: !1, line: 13, type: !19)
!41 = !DIExpression()
!42 = !DILocation(line: 13, column: 35, scope: !16)
!43 = !DILocation(line: 14, column: 2, scope: !16)
!44 = !DILocation(line: 15, column: 16, scope: !16)
!45 = !DILocation(line: 15, column: 20, scope: !16)
!46 = !DILocation(line: 15, column: 2, scope: !16)
!47 = !DILocation(line: 17, column: 2, scope: !16)
!48 = !DILocation(line: 18, column: 16, scope: !16)
!49 = !DILocation(line: 18, column: 20, scope: !16)
!50 = !DILocation(line: 18, column: 2, scope: !16)
!51 = !DILocation(line: 20, column: 2, scope: !16)
!52 = !DILocation(line: 21, column: 16, scope: !16)
!53 = !DILocation(line: 21, column: 20, scope: !16)
!54 = !DILocation(line: 21, column: 2, scope: !16)
!55 = !DILocation(line: 22, column: 10, scope: !16)
!56 = !DILocation(line: 22, column: 14, scope: !16)
!57 = !DILocation(line: 22, column: 2, scope: !16)
!58 = !DILocation(line: 22, column: 6, scope: !16)
!59 = !DILocation(line: 22, column: 8, scope: !16)
!60 = !DILocation(line: 24, column: 2, scope: !16)
!61 = !DILocation(line: 25, column: 16, scope: !16)
!62 = !DILocation(line: 25, column: 20, scope: !16)
!63 = !DILocation(line: 25, column: 2, scope: !16)
!64 = !DILocation(line: 27, column: 2, scope: !16)
!65 = !DILocation(line: 27, column: 6, scope: !16)
!66 = !DILocation(line: 27, column: 13, scope: !16)
!67 = !DILocation(line: 28, column: 2, scope: !16)
!68 = !DILocation(line: 28, column: 6, scope: !16)
!69 = !DILocation(line: 28, column: 10, scope: !16)
!70 = !DILocation(line: 29, column: 27, scope: !16)
!71 = !DILocation(line: 29, column: 31, scope: !16)
!72 = !DILocation(line: 29, column: 37, scope: !16)
!73 = !DILocation(line: 29, column: 41, scope: !16)
!74 = !DILocation(line: 29, column: 36, scope: !16)
!75 = !DILocation(line: 29, column: 33, scope: !16)
!76 = !DILocation(line: 29, column: 47, scope: !16)
!77 = !DILocation(line: 29, column: 51, scope: !16)
!78 = !DILocation(line: 29, column: 45, scope: !16)
!79 = !DILocation(line: 29, column: 56, scope: !16)
!80 = !DILocation(line: 29, column: 61, scope: !16)
!81 = !DILocation(line: 29, column: 65, scope: !16)
!82 = !DILocation(line: 29, column: 60, scope: !16)
!83 = !DILocation(line: 29, column: 14, scope: !16)
!84 = !DILocation(line: 29, column: 18, scope: !16)
!85 = !DILocation(line: 29, column: 24, scope: !16)
!86 = !DILocation(line: 29, column: 2, scope: !16)
!87 = !DILocation(line: 29, column: 6, scope: !16)
!88 = !DILocation(line: 29, column: 12, scope: !16)
!89 = !DILocation(line: 30, column: 2, scope: !16)
!90 = !DILocation(line: 32, column: 1, scope: !16)
!91 = !{!"printf"}
!92 = !{!"int.const char *__restrict.1"}
!93 = !{!"/opt/Xilinx/SDK/2018.2/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/stdio.h"}
!94 = !{!"scanf"}
!95 = !{!"puts"}
!96 = !{!"int.const char *.1"}
!97 = distinct !DISubprogram(name: "load_convolution_config", scope: !1, file: !1, line: 34, type: !17, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!98 = !{!"load_convolution_config"}
!99 = !DILocalVariable(name: "pl", arg: 1, scope: !97, file: !1, line: 34, type: !19)
!100 = !DILocation(line: 34, column: 37, scope: !97)
!101 = !DILocation(line: 35, column: 2, scope: !97)
!102 = !DILocalVariable(name: "fp", scope: !97, file: !1, line: 36, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !105, line: 7, baseType: !106)
!105 = !DIFile(filename: "/opt/Xilinx/SDK/2018.2/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/bits/types/FILE.h", directory: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/build/zed_linux_hw")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !107, line: 241, size: 1216, align: 64, elements: !108)
!107 = !DIFile(filename: "/opt/Xilinx/SDK/2018.2/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/libio.h", directory: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/build/zed_linux_hw")
!108 = !{!109, !110, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !131, !132, !133, !134, !138, !140, !142, !146, !149, !153, !154, !155, !156, !157, !158, !159}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !106, file: !107, line: 242, baseType: !25, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !106, file: !107, line: 247, baseType: !111, size: 32, align: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32, align: 32)
!112 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !106, file: !107, line: 248, baseType: !111, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !106, file: !107, line: 249, baseType: !111, size: 32, align: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !106, file: !107, line: 250, baseType: !111, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !106, file: !107, line: 251, baseType: !111, size: 32, align: 32, offset: 160)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !106, file: !107, line: 252, baseType: !111, size: 32, align: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !106, file: !107, line: 253, baseType: !111, size: 32, align: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !106, file: !107, line: 254, baseType: !111, size: 32, align: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !106, file: !107, line: 256, baseType: !111, size: 32, align: 32, offset: 288)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !106, file: !107, line: 257, baseType: !111, size: 32, align: 32, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !106, file: !107, line: 258, baseType: !111, size: 32, align: 32, offset: 352)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !106, file: !107, line: 260, baseType: !124, size: 32, align: 32, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32, align: 32)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !107, line: 156, size: 96, align: 32, elements: !126)
!126 = !{!127, !128, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !125, file: !107, line: 157, baseType: !124, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !125, file: !107, line: 158, baseType: !129, size: 32, align: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !125, file: !107, line: 162, baseType: !25, size: 32, align: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !106, file: !107, line: 262, baseType: !129, size: 32, align: 32, offset: 416)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !106, file: !107, line: 264, baseType: !25, size: 32, align: 32, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !106, file: !107, line: 268, baseType: !25, size: 32, align: 32, offset: 480)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !106, file: !107, line: 270, baseType: !135, size: 32, align: 32, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !136, line: 140, baseType: !137)
!136 = !DIFile(filename: "/opt/Xilinx/SDK/2018.2/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/bits/types.h", directory: "/home/sdsoc/yc_ws/sdx_ws/proj/YOLO-master/cpp/HGUFPGAConv/HGUConv_0/build/zed_linux_hw")
!137 = !DIBasicType(name: "long int", size: 32, align: 32, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !106, file: !107, line: 274, baseType: !139, size: 16, align: 16, offset: 544)
!139 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !106, file: !107, line: 275, baseType: !141, size: 8, align: 8, offset: 560)
!141 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !106, file: !107, line: 276, baseType: !143, size: 8, align: 8, offset: 568)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8, align: 8, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 1)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !106, file: !107, line: 280, baseType: !147, size: 32, align: 32, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !107, line: 150, baseType: null)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !106, file: !107, line: 289, baseType: !150, size: 64, align: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !136, line: 141, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !136, line: 55, baseType: !152)
!152 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !106, file: !107, line: 297, baseType: !4, size: 32, align: 32, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !106, file: !107, line: 298, baseType: !4, size: 32, align: 32, offset: 736)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !106, file: !107, line: 299, baseType: !4, size: 32, align: 32, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !106, file: !107, line: 300, baseType: !4, size: 32, align: 32, offset: 800)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !106, file: !107, line: 302, baseType: !7, size: 32, align: 32, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !106, file: !107, line: 303, baseType: !25, size: 32, align: 32, offset: 864)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !106, file: !107, line: 305, baseType: !160, size: 320, align: 8, offset: 896)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 320, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 40)
!163 = !DILocation(line: 36, column: 8, scope: !97)
!164 = !DILocation(line: 36, column: 13, scope: !97)
!165 = !DILocation(line: 37, column: 6, scope: !166)
!166 = distinct !DILexicalBlock(scope: !97, file: !1, line: 37, column: 6)
!167 = !DILocation(line: 37, column: 9, scope: !166)
!168 = !DILocation(line: 37, column: 6, scope: !97)
!169 = !DILocation(line: 38, column: 3, scope: !170)
!170 = distinct !DILexicalBlock(scope: !166, file: !1, line: 37, column: 18)
!171 = !DILocation(line: 39, column: 3, scope: !170)
!172 = !DILocation(line: 41, column: 9, scope: !97)
!173 = !DILocation(line: 41, column: 21, scope: !97)
!174 = !DILocation(line: 41, column: 25, scope: !97)
!175 = !DILocation(line: 41, column: 2, scope: !97)
!176 = !DILocation(line: 42, column: 9, scope: !97)
!177 = !DILocation(line: 42, column: 21, scope: !97)
!178 = !DILocation(line: 42, column: 25, scope: !97)
!179 = !DILocation(line: 42, column: 2, scope: !97)
!180 = !DILocation(line: 43, column: 9, scope: !97)
!181 = !DILocation(line: 43, column: 21, scope: !97)
!182 = !DILocation(line: 43, column: 25, scope: !97)
!183 = !DILocation(line: 43, column: 2, scope: !97)
!184 = !DILocation(line: 44, column: 10, scope: !97)
!185 = !DILocation(line: 44, column: 14, scope: !97)
!186 = !DILocation(line: 44, column: 2, scope: !97)
!187 = !DILocation(line: 44, column: 6, scope: !97)
!188 = !DILocation(line: 44, column: 8, scope: !97)
!189 = !DILocation(line: 45, column: 9, scope: !97)
!190 = !DILocation(line: 45, column: 21, scope: !97)
!191 = !DILocation(line: 45, column: 25, scope: !97)
!192 = !DILocation(line: 45, column: 2, scope: !97)
!193 = !DILocation(line: 46, column: 2, scope: !97)
!194 = !DILocation(line: 46, column: 6, scope: !97)
!195 = !DILocation(line: 46, column: 13, scope: !97)
!196 = !DILocation(line: 47, column: 2, scope: !97)
!197 = !DILocation(line: 47, column: 6, scope: !97)
!198 = !DILocation(line: 47, column: 10, scope: !97)
!199 = !DILocation(line: 48, column: 27, scope: !97)
!200 = !DILocation(line: 48, column: 31, scope: !97)
!201 = !DILocation(line: 48, column: 37, scope: !97)
!202 = !DILocation(line: 48, column: 41, scope: !97)
!203 = !DILocation(line: 48, column: 36, scope: !97)
!204 = !DILocation(line: 48, column: 33, scope: !97)
!205 = !DILocation(line: 48, column: 47, scope: !97)
!206 = !DILocation(line: 48, column: 51, scope: !97)
!207 = !DILocation(line: 48, column: 45, scope: !97)
!208 = !DILocation(line: 48, column: 56, scope: !97)
!209 = !DILocation(line: 48, column: 61, scope: !97)
!210 = !DILocation(line: 48, column: 65, scope: !97)
!211 = !DILocation(line: 48, column: 60, scope: !97)
!212 = !DILocation(line: 48, column: 14, scope: !97)
!213 = !DILocation(line: 48, column: 18, scope: !97)
!214 = !DILocation(line: 48, column: 24, scope: !97)
!215 = !DILocation(line: 48, column: 2, scope: !97)
!216 = !DILocation(line: 48, column: 6, scope: !97)
!217 = !DILocation(line: 48, column: 12, scope: !97)
!218 = !DILocation(line: 49, column: 9, scope: !97)
!219 = !DILocation(line: 49, column: 2, scope: !97)
!220 = !DILocation(line: 50, column: 1, scope: !97)
!221 = !{!"fopen"}
!222 = !{!"FILE .const char *__restrict.1.const char *__restrict.1"}
!223 = !{!"exit"}
!224 = !{!"void.int.0"}
!225 = !{!"/opt/Xilinx/SDK/2018.2/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/stdlib.h"}
!226 = !{!"fscanf"}
!227 = !{!"int.FILE *__restrict.1.const char *__restrict.1"}
!228 = !{!"fclose"}
!229 = !{!"int.FILE *.1"}
!230 = distinct !DISubprogram(name: "print_convolution_size", scope: !1, file: !1, line: 52, type: !17, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
